{
  "url": "https://www.tripadvisor.com/AttractionProductReview-g2656695-d11458394-Lima_Private_Walking_Tour-Lima_Region.html",
  "scraped_at": "2025-10-02T03:56:54.669712",
  "content_length": 568582,
  "title": "Lima Private Walking Tour",
  "description": "Start:Traveler pickup offered.",
  "all_descriptions": [
    "Start:Traveler pickup offered."
  ],
  "rating": null,
  "provider": "TripAdvisor, yet the driver didn't know where to drop us off.  While stopping to ask for directions multiple times, we missed the boat and got placed with another provider.",
  "reviews": [
    {
      "rating": "5",
      "title": "Lovin’ Lima",
      "text": "Wonderful experience. Well spoken and informed, Jocelyn, expertly guided us to and around the city center with many stops to discuss the historical and cultural details of the city. Hard to cover it all but received a good overview of Lima.",
      "reviewer": null,
      "date": "Jun 2024 • Couples"
    },
    {
      "rating": "5",
      "title": "Perfect tour of neighbourhoods",
      "text": "This tour was exactly what we wanted. We saw three neighbourhoods and Jocelyn was perfect -in her English and her knowledge and accommodating at the pace that we liked. It truly was a perfect private tour and much better than we ever expected! She was a delight!",
      "reviewer": null,
      "date": "Nov 2023 • Couples"
    },
    {
      "rating": "5",
      "title": "Perfect private walking tour of the historic centre of Lima",
      "text": "Our tour guide (Yosselyn) was amazing. She was so knowledgeable and was able to customise our tour according to our interests because we booked a private tour. We learned so much and saw everything we wanted to see. Would definitely recommend !",
      "reviewer": null,
      "date": "Written July 19, 2023"
    },
    {
      "rating": "5",
      "title": "Walking tour of Lima",
      "text": "We had a large group (12).  Viator recommended a private car for 130USD.  We declined and opted for public transportation as the tour was advertised.  Jocelyn met us at our hotel in Miraflores and took us on a bus to Barranco, then on another bus to the city center.  We saw the main squares, cathedrals, the presidential palace, and walked down Jiron de la Union (a pedestrian shopping street).  She offered good information about the sites, some history, and a glimpse of the contemporary Peruvian political environment.  I thought we would be finished in the city center, but she accompanied us back to Miraflores on another bus.  I’m not sure how the private car would have been incorporated into a walking tour, but we were pleased with our decision.",
      "reviewer": null,
      "date": "May 2023 • Friends"
    },
    {
      "rating": "5",
      "title": "A must in Lima. Walking tour recommended",
      "text": "David was very friendly and patient all the time si nce we were busy doing Pictures. He know alot of the past of the city which was very interesting. If you book the walk tour like we did, take some confortable shoes",
      "reviewer": null,
      "date": "Apr 2022 • Couples"
    },
    {
      "rating": "5",
      "title": "The Best of Lima in One Day",
      "text": "Jorge was wonderful. We were only in Lima for a day before heading on to Cusco, and our guide helped us make the most of it. We visited Lovers Park in Miraflores and the Bridge of Sighs in Barranco. We also got to watch the rehearsal for some of the Independence Day celebrations at the Governor’s Palace. We tasted chocolates and Pisco. The people of Lima are lovely and friendly and Jorge was extremely knowledgeable about his country and city. He took great photos of my wife and I and knew right where to go to get the great shots. We highly recommend him.",
      "reviewer": null,
      "date": "Jul 2021 • Couples"
    },
    {
      "rating": "5",
      "title": "The best sightseeing tour in the year",
      "text": "In November 2019 I had a tour with Julio, and now I can say that it was my best sightseeing tour in the year.Julio is a nice guide/buddy, and this tour is very well organized.Julio picked me up by calling me to my room at the hotel front desk exactly at 9:00AM.During the tour we saw many places of Lima, including the local market, the historic center, Parque de la Muralla and Barranco District. Julio knows every aspect of Lima transportation system, so we were able to move between important places quickly and without traffic jams.The tour took 4 hours, and they were action-packed hours. You won't be able to finish early and in fact you will be a little exhausted after the tour.I recommend that you take this particular sightseeing tour and another tour outside of Lima. While this is a good tour, there is a lot places you need to see outside of Lima in Peru.",
      "reviewer": null,
      "date": "Nov 2019"
    },
    {
      "rating": "5",
      "title": "Simply Amazing!",
      "text": "I took this tour because I had only one day in Lima and I wanted to discover as much as possible with an experienced guide so I could see and learn as much as possible.My guide was Julio Molina and he was simply exceptional!! He had so much knowledge it was incredible. He was also kind, flexible and very accommodating!Seriously, if your guide is Julio, trust me you're going to have the best tour ever!We went from the historic centre, to the local food market; saw the authentic life of Limeños and the more touristical Barranco; we had passion fruit cold brew and empanadas; and we were lucky enough to witness a celebration of people from Cusco for San Esteban, which Julio kindly accepted we watch. Indeed, he never rushed me about time and allowed me to ingest all the culture and food at my own pace.Can't give enough compliments about Julio and the tour he gave me. It's worth every penny!Thank you Julio and America Viajes!",
      "reviewer": null,
      "date": "Jan 2020 • Solo"
    },
    {
      "rating": "5",
      "title": "Time very well spent",
      "text": "We had a walking tour of the city for approximately 4 hours and at all times Jocelyn our tour guide was friendly and was very prepared to answer our questions. The colony architectural contrast and vestiges of the Inca culture make this city have incredible diversity.",
      "reviewer": null,
      "date": "Jan 2020"
    },
    {
      "rating": "5",
      "title": "Half day tour",
      "text": "I visited the city after a trip to Cusco, it was a very good way to end my visit to Peru. Thanks for being very explanatory Jorge, our guide was great.",
      "reviewer": null,
      "date": "Jan 2020"
    }
  ],
  "review_count": 10,
  "images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/6b/60/73.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/6b/60/74.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/8c/1d/e1.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-o/06/41/47/b0/getlstd-property-photo.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "all_images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/6b/60/73.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/6b/60/74.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/06/8c/1d/e1.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-o/06/41/47/b0/getlstd-property-photo.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "image_count": 7,
  "scraping_metadata": {
    "attempt": 2,
    "page_size": 568582,
    "extraction_timestamp": "2025-10-02T03:56:54.769207",
    "success": true,
    "method": "ScraperAPI",
    "ip_rotation": true,
    "captcha_solving": true
  }
}