{
  "url": "https://www.tripadvisor.com/AttractionProductReview-g294316-d20185748-Modern_and_Colonial_Lima_City_Tour-Lima_Lima_Region.html",
  "scraped_at": "2025-10-02T03:30:48.183969",
  "content_length": 1736389,
  "title": "Modern and Colonial Lima City Tour.",
  "description": "All the Guidance is done with headphones and special radio guide equipment, we are the only agency in Lima - Peru, that uses this tourist guidance system.\n\nThat makes this tourist tour much more personalized and that our tourists do not miss the narration of our guides during their tours.\n\nIt shows the main attractions of the ancient and modern city of Lima. The entire tour from start to finish is accompanied by a guide specialized in the history and culture of the city, who will make your tour enjoyable and fun. We use Headphones during the tour so that our passengers do not lose the narration of the tour guide. We offer a demonstration and tasting of Pisco Sour, for these reasons they make it a different tour from the others.",
  "all_descriptions": [
    "All the Guidance is done with headphones and special radio guide equipment, we are the only agency in Lima - Peru, that uses this tourist guidance system.\n\nThat makes this tourist tour much more personalized and that our tourists do not miss the narration of our guides during their tours.\n\nIt shows the main attractions of the ancient and modern city of Lima. The entire tour from start to finish is accompanied by a guide specialized in the history and culture of the city, who will make your tour enjoyable and fun. We use Headphones during the tour so that our passengers do not lose the narration of the tour guide. We offer a demonstration and tasting of Pisco Sour, for these reasons they make it a different tour from the others."
  ],
  "rating": null,
  "provider": "the guide was fascinating.  A must for anyone with a genuine interest in Incan history.  The drive from the tourist areas of Lima is through some of poorer and more working class neighborhoods, which was interesting in itself. The guide was able to keep us engaged even when stuck in rush hour traffic.",
  "reviews": [
    {
      "rating": "5",
      "title": "Visit Lima with Jazmin as your guide. MARAVILLOSO",
      "text": "He gave us the guided tour Jazmin, who besides being very friendly is super professional. He gave us a lot of detailed and interesting information. This visit is highly recommended as the transfers made it super easy and the visits were very nice and cared for.",
      "reviewer": null,
      "date": "Jun 2025 • Couples"
    },
    {
      "rating": "1",
      "title": "DISRESPECT, ASSAULT AND POOR SERVICE",
      "text": "BAD EXPERIENCE AND DISRESPECT AND ASSAULT.I scheduled my transfers and airport pickup with this agency, I don't really recommend them, the driver doesn't know anything about their job and all the staff wash their hands and say it's your fault, your bad organization and blah blah blah and picked up my passengers from the airport 2 hours later with all the peace and calm, they didn't provide solutions, they just said that my driver is in there (At the airport) spent more and more hours and my passengers very upset.Another worse subject called me a violent guy from this number 905468975 indicating that he was the general manager or something to insult me, assault me and raise my voice at will; this man claimed to me saying that I had called his guide on the phone to complain about the bad services they provided but it was not, the guide was angry with me because they gave him an order that was not in their chances then I imagine he went to complain to his boss, it was obviously not his job and was the operations manager who gives these orders then this aggressive and violent man in defense of his guide started to assault me.1.The guide is a person who is not trained to provide a service and provide solutions to such a simple situation, they spend it complaining and seems like a gossip that does not know if I work.2.The general manager is a despot and aggressive guy, has no anger management and does not know how to respect a person, a woman, insults and raises his voice at will. Never in my whole life have I dealt with a guy so despot and violent and literally shocked.",
      "reviewer": null,
      "date": "May 2025 • Business"
    },
    {
      "rating": "5",
      "title": "Excellent",
      "text": "They were very nice tours, and our guide Jasmine super friendly and with a lot of knowledge on the topics.My sister and I were very happy with the care provided.",
      "reviewer": null,
      "date": "Feb 2025 • Family"
    },
    {
      "rating": "5",
      "title": "Super good.",
      "text": "Super good with Jazmin, 100% recommended.  He has told us all kinds of historical information and data. Delighted with your tour.",
      "reviewer": null,
      "date": "Written February 15, 2025"
    },
    {
      "rating": "5",
      "title": "Lima- Beautiful city",
      "text": "We had a wonderful time, we learned about the history of Lima that is generally unknown and how this beautiful city was modernized. We took a lot of pictures, ate rich and had a lot of fun, 100% recommended and excellent our guide, a tremendous applause Jazmin.",
      "reviewer": null,
      "date": "Feb 2025 • Couples"
    },
    {
      "rating": "5",
      "title": "Excellent option to know the city",
      "text": "Excellent option to meet Lima, Jazmin was a love with us, he could explain everything calmly. Fully recommended!",
      "reviewer": null,
      "date": "Feb 2025 • Couples"
    },
    {
      "rating": "5",
      "title": "Excellent",
      "text": "We visited the places we were looking to visit, we really liked it. The tour was carried out by Jasmin, she shared all the information and we had no problem, we would take it again:).",
      "reviewer": null,
      "date": "Oct 2024 • Couples"
    },
    {
      "rating": "5",
      "title": "Good tour dynamics",
      "text": "Excellent tour, I liked more the theme of bringing a hearing aid to listen to the guide and not miss the comments.Good explanation on topics and good timing.",
      "reviewer": null,
      "date": "Oct 2024 • Couples"
    },
    {
      "rating": "5",
      "title": "VERY NICE",
      "text": "I just took the City Tour with the Jazmin guide, definitely the best service I have received so far. The hearing aids we were given were very supportive in the center of Lima. Highly recommended.",
      "reviewer": null,
      "date": "Oct 2024 • Solo"
    },
    {
      "rating": "2",
      "title": "Visit of the center of Lima organized",
      "text": "I did the full day tour in July last year with a friend. The tour as such was not bad. It is safe and informative.Negative points:They ask to leave a good comment without having started the tour, just one gets on, in exchange for a discount on an upcoming tour.It was supposed that in the convent, the visit to the catacombs was included but no, only the floor above was visited.The tour ends with a visit to a Souvenir with which they work and make a pisco tasting. DO NOT shop there, prices are inflated, days later we saw the same bottles of pisco or souvenirs that we bought 3 times less than the price we paid there in another souvenir or even in the supermarket.",
      "reviewer": null,
      "date": "Aug 2023 • Friends"
    }
  ],
  "review_count": 10,
  "images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/de/e3.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/df/9d.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/df/a1.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-o/18/5b/bd/1b/agencia-de-viajes-tour.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "all_images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/de/e3.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/df/9d.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/74/df/a1.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-o/18/5b/bd/1b/agencia-de-viajes-tour.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "image_count": 7,
  "scraping_metadata": {
    "attempt": 1,
    "page_size": 1736389,
    "extraction_timestamp": "2025-10-02T03:30:48.284791",
    "success": true,
    "method": "ScraperAPI",
    "ip_rotation": true,
    "captcha_solving": true
  }
}