{
  "url": "https://www.tripadvisor.com/AttractionProductReview-g294316-d14942992-Lima_Vegan_Peruvian_Food_Tour-Lima_Lima_Region.html",
  "scraped_at": "2025-10-02T04:58:36.306121",
  "content_length": 1800611,
  "title": "Lima Vegan Peruvian Food Tour",
  "description": "Eating a vegan diet doesn't mean you need to miss out on any popular Peruvian cuisines. This vegan culinary tour takes you to eight hand-selected restaurants where you can try a total of 14 vegan dishes like fish-free ceviche, quinoa dishes, and more over the course of a half day. Plus, hear stories behind the sights you see as you pass.",
  "all_descriptions": [
    "Eating a vegan diet doesn't mean you need to miss out on any popular Peruvian cuisines. This vegan culinary tour takes you to eight hand-selected restaurants where you can try a total of 14 vegan dishes like fish-free ceviche, quinoa dishes, and more over the course of a half day. Plus, hear stories behind the sights you see as you pass.",
    "ItineraryThis is a typical itinerary for this productStop At:Exquisito Perú - Food Tours in Lima, Arequipa & Cusco, Of 102, Av. Almte. Miguel Grau 713, Barranco 15063, PeruParticipate in a biodiverse workshop to discover vegetables, corns, tubercles and taste different types of Peruvian fruits. End with a chocolate tasting sessions with a fun game to test you tastebudsDuration: 30 minutesStop At:Bajada de los Banos, Municipalidad del Barranco desde el Parque Barranco hasta la Costa Verde., Lima 15047 PeruWalk around Barranco’s most iconic sights such as Puente de Los Suspiros y Bajada de baños. We will even stop at a local artist’s gallery.Duration: 30 minutesStop At:Barranco, Lima PeruVisit the neighborhood of BarrancoDuration: 3 hours",
    "Start:Multiple pickup locations offered."
  ],
  "rating": null,
  "provider": "our tour guide Nathaly.",
  "reviews": [
    {
      "rating": "5",
      "title": "Great vegan food tour",
      "text": "We had a fantastic time on the vegan food tour with Nathaly! It was great having the opportunity to taste vegan versions of authentic dishes as well as exploring the city. Nathaly was very friendly and knowledgeable and made our tour a lot of fun. Would highly recommend this even if you only have 1-2 days in Lima!",
      "reviewer": null,
      "date": "Sep 2022"
    },
    {
      "rating": "5",
      "title": "Trip of a lifetime! Five star Service and quality",
      "text": "As an Indian American Vegetarian family of 3 (2 adults and a 12 year old child), we feel fortunate to have picked this trip for our Lima trip. Dulce was our guide for the day and she was so diligent, intelligent, attentive, funny, entertaining that she made this a trip of a lifetime! We walked around the beautiful Barranco neighborhood with Dulce, started our journey with a tasting session with history and gastronomy lesson. With several stops through the 4 hours trip, there were thousands of picture moments through the trendy and stylish neighborhood. Dulce taught us so much about Peruvian culture, cuisine and her history. We enjoyed every stop and the delicious food and drinks. I would highly recommend this trip and a special mention of Dulce as your guide! She will make this a family trip worth cherishing for lifetime.",
      "reviewer": null,
      "date": "Jun 2022 • Family"
    },
    {
      "rating": "5",
      "title": "So much fun and great food!",
      "text": "We did the vegan food tour in the Barranco area while in Lima on vacation. Johana was such a great guide — she provided so much insight into the local culture and neighborhoods, and made us feel welcome. Bring your appetite for this tour, which I highly recommend.",
      "reviewer": null,
      "date": "Written June 8, 2021"
    },
    {
      "rating": "5",
      "title": "Awesome Adventure!!!!",
      "text": "This tour was incredible and Galia was the best tour guide I’ve ever had hands down!! We visited 5 awesome restaurants/cafes and we loved each one of them and learned so much about Peruvian culture and food. We enjoyed coffee, delicious chocolate, ceviche, potatoes, fried zucchini with rice and gelato. We also learned how to make a Pisco Sour. This was the highlight of our trip and we will definitely do more tours with Galia when we return!! Thank you so much for this wonderful adventure!!",
      "reviewer": null,
      "date": "Nov 2019 • Family"
    },
    {
      "rating": "5",
      "title": "Amazing vegan food",
      "text": "Awesome vegan sampling tour. Natalie is very knowledgeable about food, but also history and politics. Visited chocolate shop; small local market where we tried juices and fruits, restaurant for vegan ceviche, another restaurant for spirits and Chinese food, and finished with sorbet.One of the best half day tours I have ever done. Natalie is a gem.",
      "reviewer": null,
      "date": "Nov 2019 • Friends"
    },
    {
      "rating": "5",
      "title": "Yummy Peruvian Food!",
      "text": "Galia was our super-friendly and sweet tour guide. The tour was a nice way to see some lovely streets in an unhurried manner. The selection of places to sample food was outstanding and super local. We particularly loved the  ceviche place and the pisco place where we also got a sizable portion of the saltado. Galia also took us into the kitchen at one of the places to watch the chef!",
      "reviewer": null,
      "date": "Oct 2019"
    },
    {
      "rating": "5",
      "title": "Amazing Vegan Foods of Lima",
      "text": "Galia was an amazing tour guide, super friendly and sweet. She guided us on a walking tour of Barranco stopping at all these cute spots to teach us about the Peruvian culture and foods. It was a very informative tour and we got to taste so many delicious traditional Peruvian foods and drinks. Galia was amazing, she took many photos of us and really made the experience so social.",
      "reviewer": null,
      "date": "Aug 2019"
    },
    {
      "rating": "5",
      "title": "Wonderful Way to See La Barranca",
      "text": "This tour was a fantastic way to spend a half day in Lima. Vegan preferences are well accommodated and I was able to experience delicious flavors as well as take in the ambiance and history of La Barranca. All arrangements flowed smoothly and I really enjoyed spending time with my guide who was really wonderful!I recommend this tour!",
      "reviewer": null,
      "date": "Aug 2019 • Solo"
    },
    {
      "rating": "5",
      "title": "Awesome tour for non-vegans and vegans",
      "text": "Nathaly is an amazing guide and one of our favorite guides we've had. =)She was friendly, easy to understand and shared a lot of interesting facts that kept my attention.My husband is not vegan and he said this was his favorite tour of our Peru trip.  That says a lot!  So if you're not vegan - it's okay....don't be afraid.I did not expect to enjoy it so much.  I thought it was just going to be tasting food from one vegan restaurant to the next.  It was educational and interesting.I loved learning about the different flavor profiles of the chocolate and how it's made.Fruit tasting was cool - I now love granadillas so much!The Chilcano drink gave me a nice buzz. =)I really like how we were able to view the preparation of the food and drinks sampled. It's a very nice touch - there's more learning that way.One suggestion would be to let the restaurant know ahead of time (or remind them) - of anyone's dietary restrictions.  It is labeled a vegan tour - I expected all of the dishes we sampled to be vegan.  They had to remake the causa and also they had fish stock ready to be put in the ceviche.  It's not a big deal because I always ask about all the ingredients before eating.Totally recommend this tour for everybody!",
      "reviewer": null,
      "date": "Jul 2019 • Couples"
    },
    {
      "rating": "5",
      "title": "Great visit of the culinary wonders of Peru",
      "text": "Great tour of old area of Barrancos, lead by our tour guide Desiree. Very interesting, varied, going from chocolate to pisco sour and ceviche.We enjoyed ourselves and learnt quite a bit about every day life in Peru",
      "reviewer": null,
      "date": "Written July 8, 2019"
    }
  ],
  "review_count": 10,
  "images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/a5/cb/77.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/3f/1d/24.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/a5/cb/7a.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-m/1280/14/55/10/15/pan-con-chicharron.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "all_images": [
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/wordmark.svg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/a5/cb/77.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/3f/1d/24.jpg",
    "https://media-cdn.tripadvisor.com/media/attractions-splice-spp-674x446/0a/a5/cb/7a.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/travelers_choice/badges/2025/2025_Best_of_the_Best_Badge_Large.svg",
    "https://media-cdn.tripadvisor.com/media/photo-m/1280/14/55/10/15/pan-con-chicharron.jpg",
    "https://static.tacdn.com/img2/brand_refresh_2025/logos/logo.svg"
  ],
  "image_count": 7,
  "scraping_metadata": {
    "attempt": 2,
    "page_size": 1800611,
    "extraction_timestamp": "2025-10-02T04:58:36.411807",
    "success": true,
    "method": "ScraperAPI",
    "ip_rotation": true,
    "captcha_solving": true
  }
}